module Response
  class Includes < Response::Base
    def process
      data.keys.each do |key|
        if key.is_a?(Array)
          key.each do |sub_key|
            success answer(key) if @text.include?(sub_key)
          end
        else
          success answer(key) if @text.include?(key)
        end
      end
    end

    private

    def data
      # To include phrase but does not similar bigger phrase, do it that way:
      #   "цікав" => nil, "кав" => answers("coffee")
      {
        ["в рот", "врот"] => answers("mouth"),
        ["ахах", "f[f["] => answers("laugh"),
        "))" => answers("smile"),
        "((" => answers("sad"),
        "ааа" => answers("aaa"),
        "ооо" => answers("ooo"),
        phrases("thank") => answers("thank"),
        phrases("morning") => answers("morning", first_name: @user.first_name),
        "цікав" => nil, "кав" => answers("coffee"),
        "годин" => nil, "один" => "Проти цілого світу?",
        ["текіл", "свєт"] => "Мальчікіііііііі",
        ["пить", "пити", "бухат"] => "Шоб і не балакать",
        "заборони" => "Забороняю!",
        "вічність" => "Вічність тут",
        "дізна" => ["Ні, ти не дізнаєшся", "Ні, ти не дізнаєшся ніколи"],
        "смислі" => "В коромислі", "смислє" => "В коромислє",
        ["бик", "бичар"] => answers("byk"),
        "кайф" => "Кайф лютий",
        "гандон" => "Штопаний",
        "плачу" => answers("plachu"),
        "рево" => answers("revo"),
        ["важко", "тяжко"] => "А кому легко",
        "чуєш" => "На хую переночуєш",
        "прекрасно" => "Ні, це жахливо",
        "жах" => ["Ні, це прекрасно", "Ні, це ахуєнно"],
        ["не вірно", "невірно"] => "Ні, це вірно",
        "вірно" => answers("virno"),
        ["не правильно", "неправильно"] => "Ні, це правильно",
        "правильно" => answers("pravylno"),
        "алкоголь це яд" => "Отрута це гурт",
        "алкоголь" => "Алкоголь це яд",
        "отрута" => "Отрута це гурт",
        ["в аху", "ваху"] => "Ні, ти не в ахуі",
        "боря друг" => "Боря брат", "саша друг" => "Саша брат",
        "саня друг" => "Саня брат", "сєрий друг" => "Сєрий брат",
        "данік друг" => "Данік брат", "даня друг" => "Даня брат",
        "мормуль друг" => "Мормуль брат",
        "боря" => ["БОРЯЯЯЯЯ!!", "Боря блять"],
        ["сєрий", "сірий"] => "СЄРЬОЖАААА!!",
        "саша" => "САШАААААА!!", "саня" => "САНЯЯЯЯЯЯ!!",
        "данік" => "ДАНІІІК!!", "даня" => "ДАНЯЯЯЯЯЯ!!",
        "мормуль" => "МОРМУУУУЛЬ!!",
        "мінімум" => "Більше можна \nМенше нізя",
        "максимум" => "Менше можна \nБільше нізя",
        ["більше можна", "можна більше"] => "Менше нізя",
        ["менше можна", "можна менше"] => "Більше нізя",
        "не сподобалось" => "Ні, тобі сподобалось", "сподобалось" => "Ні, не сподобалось",
        "послухав" => "Ні, не послухав", "послухаю" => "Ні, не послухаєш",
        "сдєлав?" => "Проєбав",
        "джент корпорейшн" => answers("djent_corp"),
        "підар" => "Підари кругом",
        "бог дав" => "Бог взяв",
        "чіна" => answers("china"),
        "кріпт" => answers("crypt"),
        "свій оазис" => "Не знайти, а створити",
        "оазис" => "Його не знайти",
        "вибач" => answers("sorry"),
        "не ригай хуйню" => ["Я должен", "Я буду", "Я не можу"],
        "заткнись" => ["Я не можу", "Ні, буду пиздіть", "Ні, не заткнусь"],
        ["закрий", "стули", "завали"] => ["Я не можу", "Ні, буду пиздіть"],
        "живий" => "Назавжди живий",
        "горить" => "Поглянь як горить",
        ["сюда", "суда"] => "На базу",
        ["за шо", "зашо"] => "За все хароше",
        "рисова" => nil, "шляпа"  => "Рисова",
        "рисові" => nil, "шляпи"  => "Рисові",
        "шляпа рисова" => ["Шляпа з рису, получається", "Їв таку шляпу, не смачна"],
        "не смішно" => "Ні, це смішно", "смішно" => "Ні, це не смішно",
        "аменр" => "Ти заєбав зі своєю Аменрою",
        ["гнів", "відчай"] => "Розпач",
        "ненавиджу" => "Я не навиджу тебе \nТи ненавидиш мене",
        "кожний день" => "Кожна хвилина", "кожна хвилина" => "Кожна секунда",
        "кожна секунда" => "Кожна година", "кожна година" => "Кожний місяць",
        "кожний місяць" => "Кожний рік", "кожний рік" => "Мають значення для нас всіх",
        "мають значення" => "Для нас всіх",
        "лишився лише" => "РОЗПАЧ!", "в моїй душі" => "РООООЗПААААААААЧ!!!!",
        ["кожн", "кожен"] => "Кожний день", "кожна" => "Кожна хвилина",
        [" рай", " раю"] => "Тісний рай, получається",
        "виставка дисторшн" => "Виставка Поноса",
        "виставку дисторшн" => "Виставку Поноса",
        "виставк" => "Дисторшн",
        "добраніч" => answers("night", first_name: @user.first_name),
        "правий" => "Лівий", "лівий" => "Правий",
        "мінуси" => "Мінусів нема", "плюси" => "Плюсів нема",
        "ясно" => ["Хуясно", "Ні, пасмурно"],
        ["набереш", "набирай"] => ["Наберу", "Наберу, на старий"],
        "нахуя" => "Шоб сміху було дохуя",
        ["не нада", "ненада"] => "Нада", ["нада", "надо"] => "Ні, не нада",
        "не можу" => "Ні, ти можеш", "можу" => "Ні, не можеш",
        "не можна" => "Можна", "можна" => "Ні, не можна",
        "не люблю" => "Ні, ти любиш", "люблю" => "Ні, не любиш",
        "не треба" => "Ні, треба", "треба" => "Ні, не треба",
        "не будем" => "Будете", "будем" => "Ні, не будете",
        "не буду" => "Ні, ти будеш", "буду" => "Ні, не будеш",
        "не будуть" => "Ні, вони будуть", "будуть" => "Ні, не будуть",
        "не буде" => "Ні, буде", "буде" => "Ні, не буде",
        "не хочу" => "Ні, ти хочеш", "хочу" => "Ні, не хочеш",
        "не знаю" => "Ні, ти знаєш", "знаю" => "Ні, ти не знаєш",
        "не поняв" => "Ні, ти поняв", "поняв" => "Ні, ти не поняв",
        "?" => answers("question"),
        "!" => answers("exclamation")
      }
    end
  end
end
